# -*- coding: utf-8 -*-
import re 

pattern = re.compile(r'([А-ЯA-Z]((т.б.|т.с.с.|ж.|с.)|[^?!.\(]|\([^\)]*\))*[.?!])')
text="Бакалаврдың әрбір мамандығында жұмыскерлер мен білім алушылардың талаптарына сәйкес 2-3 білім бағдарламалары өнделген. Әрбір білім алушы өздігінен оқуының біліми траекториясын құрады. Бүгінгі күнде факультетте 500 студент және 40 магистрант білім алуда. Факультеттің құрылымында 3 кафедра бар: информатика және математика, ақпараттық жүйелер, бағдарламалық қамтамасыз ету. Факультетте локальді желі, Интернет, Wi-Fi қосылған замандағы 15 компьютерлік сыныптармен қамтамасыз етілген мықты материалды-техникалық базасы бар. Кафедра құрамында практикалық шеберліктерін, дағдыларын, ғылыми зерттеулерін өткізуге арналған қазіргі заманғы техникалық және бағдарламалық қамтамасыз етумен жайластыру үшін келесі лабораториялар қалыптастырылған: «Компьютерлік жүйелер архитектурасының лабораториясы», «Телекоммуникациялық және түйіндесу құрылғысы аппаратының лабораториясы», «Ақпараттық жүйелер лабораториясы». Оқу-тәрбиелік процессі 50 адамнан астам докторлар, ғылым кандидаттары, профессорлар, доценттер, магистрлерден тұратын жоғарыквалификациялы профессорлық- оқыту құрамын қалыптастырады. Факультеттің білім алушыларына шетел ғалымдарымен дәріс оқуы да қалыптастырылады, мысалы, Карлос Мачадо (Бельгия), Иост Круль (Голландия). "

word = "әрбір"

text_list = []

for i,sent in enumerate(pattern.findall(text)):
    # print('[{}]{}'.format(i+1,sent[0]))
    text_list.append(sent[0])

# print(text_list)

number_list = []

for index, item in enumerate(text_list):
    result = re.findall(r'кафедра', item)
    if len(result) > 0:
        print(item)
        number_list.append(index)
    

print(number_list)